# Используем официальный образ с компилятором GCC
FROM gcc:latest

# Устанавливаем необходимые утилиты, включая cmake
RUN apt-get update && apt-get install -y cmake gdb

# Создаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем исходный код проекта в рабочую директорию контейнера
# На данном этапе это не обязательно, так как мы будем монтировать том,
# но это хорошая практика для создания самодостаточных образов.
COPY . .

# Команда, которая будет выполняться по умолчанию при запуске контейнера.
# В данном случае, просто запускаем оболочку bash.
CMD ["bash"]
